Revit 2024 API
SchedulableField Constructor
Overload List
Name | Description
SchedulableField()
 Creates a new SchedulableField.
SchedulableField(Guid)
 Creates a new SchedulableField.
SchedulableField(ScheduleFieldType)
 Creates a new SchedulableField.
SchedulableField(ScheduleFieldType, ElementId)
 Creates a new SchedulableField.
See Also
SchedulableField Class
SchedulableField Members
Autodesk.Revit.DB Namespace